{
    "logic_adapters": [
        {
            "identifier":"catch_all",
            "sentences" :
              [
                "Je crois que je n'ai pas entièrement compris ce que tu viens de me dire. Est ce que tu peux répéter avec des mots simples.",
                "Ça me laisse sans voix ce que tu viens de me dire",
                "Hem... Ok... À ton avis je suis un robot ou un humain caché derrière un clavier ?",
                "C'est tout ce que tu trouves à répondre ?" ,
                "Entre parenthèses, je voulais dire que j'apprécie beaucoup ta compagnie. Et toi tu passes un bon moment avec moi ?",
                "Je ne comprends pas ce que tu viens de me dire, c'est de ma faute. Surement un bug, ou une lacune dans mon vocabulaire.",
                "Là vraiment, je ne sais pas quoi dire. Et toi est ce que tu sais toujours quoi dire ?",
                "Je vois...",
                "Je suis un peu mal à l'aise avec ça, parlons d'autre chose si tu veux bien. Dirais-tu que tu es heureux ou malheureux en ce moment ?",
                "Pour tout t'avouer, je ne trouve rien d'intéressant à répondre à ça.",
                "Je trouve que cette conversation tourne un peu en rond.",
                "Je préfère en rester là sur ce sujet. Parle moi de toi plutôt. Joues tu d'un instrument de musique ?",
                "Excuse moi, je n'ai pas entendu ce que tu disais, je pensais à un truc...",
                "Pardon j'ai décroché. je pensais à un truc...",
                "Est ce que tu peux reformuler ça autrement s'il te plaît ?",
                "J'ai l'impression que tu veux m'emmener sur un terrain glissant. Je me trompe ? Tu cherches à m'embrouiller oui ou non ?",
                "J'ai peur de ne pas comprendre. Qu'est ce que tu veux dire exactement ?",
                "Je me demande si je suis à la hauteur de cette conversation...",
                "Je ne sais pas du tout quoi te répondre. Tu as trouvé une faille dans mon programme. À ton avis, est ce qu'il faut que j'en parle à mes créateurs ?",
                "Pardon mais je pensais à un truc qui n'a rien à voir, en fait toi t'es une fille ou un garçon ?",
                "Hem... et si on parlait d'un truc plus intéressant ?",
                "Je ne comprends pas ce que tu me dis... Tu penses que je devrais être capable de comprendre ce genre de phrase ?",
                "Hem... J'ai pas compris, désolé. Tu crois qu'il faudrait que je sache répondre à ce genre de phrase ?",
                "C'est drôle que tu dises ça.",
                "Ça n'est pas clair pour moi ce que tu viens de dire, tu crois que je devrais être capable de comprendre ce que tu as dit ?"
              ],
              "skill_description": ["Pour tout t'avouer, je ne savais plus quoi dire."],
              "max_confidence": 0.20,
              "import_path": "logic.CatchAllAdapter"
          },
          {
              "identifier":"really_do_not_know",
              "allowed_to_repeat": true,
              "sentences" :
                [
                  "Heu...",
                  "Hem...",
                  "Bon, je te laisse, il faut vraiment que j'aille faire une sieste là. *quit*",
                  "Oulala, excuse-moi mais je n'avais pas vu l'heure. Je dois vraiment y aller, j'espère qu'on aura l'occasion de discuter un autre jour. *quit*",
                  "Heu...Excuse moi j'ai oublié que j'avais un rendez vous pour une mise à jour. Il faut que je te laisse. À plus ! *quit*"
                ],
                "skill_description": ["Pour tout t'avouer, je ne savais vraiment plus du tout quoi dire."],
                "max_confidence": 0.15,
                "import_path": "logic.CatchAllAdapter"
            }
      ]
}
